slaw0/async-robot/AT90CAN_ASYNC.c
/****************************************************************************************************/
/*																									*/
/* AT90CAN_SYNC.C																					*/
/*																									*/
/* CAN - SPI peripherals transceiver firmware for MPC555 based robot controller						*/
/*																									*/
/* Date:	March 20, 2012																			*/
/*																									*/
/* Author: Opra Balazs																				*/
/*																									*/
/* Based on: Atmel CAN spy echo example																*/
/*																									*/
/****************************************************************************************************/
/* Compiler: AVR-GCC																				*/
/* Target platform: MPC555 robot controller															*/
/****************************************************************************************************/

/****************************************************************************************************/
/* Include files																					*/
/****************************************************************************************************/


#include "AT90CAN_ASYNC.h"

/****************************************************************************************************/
/*****  Global variables 																		*****/
/****************************************************************************************************/

volatile int16_t input_coords[2];
volatile U8 invgeo_error;
volatile U8 keys_value;
volatile U8 digits_input;
volatile U8 coord_edited;
volatile U8 keys;
volatile U8 previous_keys;
volatile char digit_buf[2];
volatile char buf[80]; //buffer for string operations
volatile char value_string[5]; //buffer for string converted from U16 format
CAN_packet init_ack_async_packet;
CAN_packet stop_button_packet;
CAN_packet primitive_button_packet;
CAN_packet async_request_packet;
CAN_packet input_coords_packet;
//menu_sates menu_state;
volatile enum INIT_STATUS init_status;
volatile enum OPERATION_STATE operation_state;
volatile enum OPERATION_STATE previous_operation_state;
volatile enum CONFIG_STATE config_state;
volatile enum CONFIG_STATE previous_config_state;
volatile enum CONTROLLER_STATE controller_state;
volatile enum CONTROLLER_STATE previous_controller_state;
//Bluetooth to can package construction
volatile U8 bt_package_flag;//if [1,2] we receive the X coordinates, if [3,4] then the Y
volatile int16_t bt_coord_buffer;
/****************************************************************************************************/
/*****  Function prototypes																		*****/
/****************************************************************************************************/

ISR(TIMER1_COMPA_vect);

/****************************************************************************************************/
/*****  Function definitions																	*****/
/****************************************************************************************************/

/********************
main function
***********************/


int main(){
	char first_line[40];
	char second_line[40];
	U8 i;
	//menu_states menu_state;
	operation_state = init;
	previous_operation_state = init;
	config_state = previous_config_state = reset_incntrs;
	init_status = no_init;
	keys = previous_keys = 0;	
	bt_package_flag = 0;
	bt_coord_buffer = 0;
	
	//prepare the init_ack_async_packet
	init_ack_async_packet.id = 0x03;
	init_ack_async_packet.length = 1;
	init_ack_async_packet.data[0] = 0x15;

	//prepare the stop_button_packet
	stop_button_packet.id = 0x04;
	stop_button_packet.length = 1;
	stop_button_packet.data[0] = 0x01;

	//prepare the primitive_button_packet
	primitive_button_packet.id = 0x08;
	primitive_button_packet.length = 1;
	primitive_button_packet.data[0] = 0x00;

	//prepare the async_request_packet
	async_request_packet.id = 0x0C;
	async_request_packet.length = 1;
	async_request_packet.data[0] = 0x00;

	//prepare the input_coords_packet
	input_coords_packet.id = 0x0F;
	input_coords_packet.length = 4;
	for (i = 0; i < input_coords_packet.length; i ++) input_coords_packet.data[i] = 0;


	system_init();
	reset_string();	

	for (i=0; i<80; i++){
		first_line[i] = 0x00;	
		second_line[i] = 0x00;
	}
	

	//global interrupt enable
	sei();
	if (!add_string("Initializing...",0)) red_LED_on;
	LCD_text();
	
	green_LED_on();

	if (prepare_rx(1,0x01,0xFF,incoming_init)) red_LED_on();  //debug for incoming message
	
//	UART_BT_transmit('A');

	while(1){
		if (init_status == init_2) {
			LCD_text();
		} else if (init_status == running) {
			switch (operation_state) {
			/////////////////// PRIMITIVE MODE ///////////////////////
			case primitive:
				if (previous_operation_state != operation_state) {
					reset_string();
					add_string("- Direct operation -", LINE_1);
					add_string("S1:      S2:", LINE_3);
					add_string("<-* Change mode  #->", LINE_4);
					previous_operation_state = operation_state;

					disable_BT_module();
				}
				if (keys != previous_keys) {
					switch (keys) {
						case STOP_BUTTON:
							while(!can_tx(2, &stop_button_packet));
							reset_line_2();
							add_string("Stopped", LINE_2);
							break;
						case POSITIVE_BUTTON_1:
							primitive_button_packet.data[0] = 0x01;
							while(!can_tx(2, &primitive_button_packet));
							reset_line_2();
							add_string("Seg 1 pos movement", LINE_2);
							break;
						case POSITIVE_BUTTON_2:
							primitive_button_packet.data[0] = 0x02;
							while(!can_tx(2, &primitive_button_packet));
							reset_line_2();
							add_string("Seg 2 pos movement", LINE_2);
							break;
						case NEGATIVE_BUTTON_1:
							primitive_button_packet.data[0] = 0x03;
							while(!can_tx(2, &primitive_button_packet));
							reset_line_2();
							add_string("Seg 1 neg movement", LINE_2);
							break;
						case NEGATIVE_BUTTON_2:
							primitive_button_packet.data[0] = 0x04;
							while(!can_tx(2, &primitive_button_packet));
							reset_line_2();
							add_string("Seg 2 neg movement", LINE_2);
							break;
						case 0:
							if ((previous_keys == POSITIVE_BUTTON_1) ||
								(previous_keys == POSITIVE_BUTTON_2) ||
								(previous_keys == NEGATIVE_BUTTON_1) ||
								(previous_keys == NEGATIVE_BUTTON_2)) {

								primitive_button_packet.data[0] = 0x05;
								while(!can_tx(2, &primitive_button_packet));
								reset_line_2();
								add_string("No movement", LINE_2);
							}
							break;
						case PREV_MODE_BUTTON:
							async_request_packet.data[0] = CONFIG_MODE_REQUEST;
							while(!can_tx(6, &async_request_packet));
							break;
						case NEXT_MODE_BUTTON:
							async_request_packet.data[0] = CONTROLLER_MODE_REQUEST;
							while(!can_tx(6, &async_request_packet));
							break;
						default: break;
					}
					previous_keys = keys;
				}
				break;
			/////////////////// CONTROLLER MODE ///////////////////////
			case controller:
				if (previous_operation_state != operation_state) {
					reset_string();
					add_string("-  Controller on   -", LINE_1);
					add_string(" (2) - Input coords ", LINE_2);
					reset_line_3();				
					add_string("<-* Change mode  #->", LINE_4);
					previous_operation_state = operation_state;
					controller_state = previous_controller_state = hold;

					disable_BT_module();
					invgeo_error = 0;
				}
				if (previous_controller_state != controller_state) {
					switch (controller_state) {
						case input:
							reset_line_2();
							add_string("Enter input!(* - OK)", LINE_2);
							reset_line_3();
							add_string("X:      Y:", LINE_3);
							digits_input = 0;
							input_coords[0] = 0;
							input_coords[1] = 0;
							coord_edited = 0;
							break;
						case hold:
							reset_line_2();
							reset_line_3();
							add_string(" (2) - Input coords ", LINE_2);
							if (invgeo_error) add_string("   Invgeo error!    ", LINE_3);
							break;
						case accepted:
							invgeo_error = 0;
							reset_line_2();
							reset_line_3();
							add_string("Invgeo OK! (2)-Start", LINE_2);
							break;
						case trajectory:
							reset_line_2();
							reset_line_3();
							add_string("Following trajectory", LINE_2);
							break;
						default: break;
					}
					previous_controller_state = controller_state;
				}
				if (keys != previous_keys) {
					cli();
					switch (controller_state) {
						case hold:
							switch (keys) {
								case ENTER_INPUT_MODE_BUTTON:
									controller_state = input;
									break;
								case PREV_MODE_BUTTON:
									async_request_packet.data[0] = PRIMITIVE_MODE_REQUEST;
									while(!can_tx(6, &async_request_packet));
									break;
								case NEXT_MODE_BUTTON:
									async_request_packet.data[0] = BLUETOOTH_MODE_REQUEST;
									while(!can_tx(6, &async_request_packet));
									break;								
								default: break;
							}
							break;
						case input:
							switch (keys) {
								case FINISH_INPUT_BUTTON:
									digits_input = 0;
									if (coord_edited == 0) coord_edited++;
									else {
										controller_state = hold;
										prepare_input_coords_packet();
										while(!can_tx(8, &input_coords_packet));
									}
									break;
								case CHANGE_SIGN_BUTTON:
									input_coords[coord_edited] = input_coords[coord_edited] * (-1);
									if (input_coords[coord_edited] >= 0) add_string(" ", LINE_3 + 2 + coord_edited * 8);
									else add_string("-",  LINE_3 + 2 + coord_edited * 8);
									break;
								default:
									if (keys == 0) break;
									keys_value = keys;
									if (keys_value == 11) keys_value = 0;								

									if ((input_coords[coord_edited] == 0) && (digits_input == 1)) {
										if (keys_value == 0) break;
										else --digits_input;
									}
									

									input_coords[coord_edited] = input_coords[coord_edited] * 10 + keys_value;
									keys_value += 48;
									digit_buf[0] = keys_value;
									digit_buf[1] = 0;
									add_string(digit_buf, LINE_3 + 3 + coord_edited * 8 + digits_input);

									if (++digits_input == MAX_DIGITS_NUM) {
										digits_input = 0;
										if (coord_edited == 0) coord_edited++;
										else {
											controller_state = hold;		
											prepare_input_coords_packet();
											while(!can_tx(8, &input_coords_packet));
										}
									}
									break;
							}
							break;
						case accepted:
							switch (keys) {
								case START_TRAJECTORY_BUTTON:
									async_request_packet.data[0] = START_TRAJECTORY_REQUEST;
									while(!can_tx(6, &async_request_packet));
									async_request_packet.data[0] = EMPTY_REQUEST;
									while(!can_tx(6, &async_request_packet));
									controller_state = hold;
									break;
								case PREV_MODE_BUTTON:
									async_request_packet.data[0] = PRIMITIVE_MODE_REQUEST;
									while(!can_tx(6, &async_request_packet));
									break;
								case NEXT_MODE_BUTTON:
									async_request_packet.data[0] = BLUETOOTH_MODE_REQUEST;
									while(!can_tx(6, &async_request_packet));
									break;								
								default: break;
							}
							break;
						default: break;
					}
					previous_keys = keys;
					sei();
				}
				break;
			/////////////////// BLUETOOTH MODE ///////////////////////
			case bluetooth:
				if( bt_package_flag == 5 ){	//There are no partial coordinates
					//Updating the coordinates
					controller_state = hold;
					prepare_input_coords_packet();
					while(!can_tx(8, &input_coords_packet));
					
					//Updating the trajectory
					async_request_packet.data[0] = START_TRAJECTORY_REQUEST;
					while(!can_tx(6, &async_request_packet));
					async_request_packet.data[0] = EMPTY_REQUEST;
					while(!can_tx(6, &async_request_packet));
					controller_state = hold;
					
					bt_package_flag = 0;
				}
				if (previous_operation_state != operation_state) {
					reset_string();
					add_string("-  Bluetooth mode  -", LINE_1);
					reset_line_2();				
					add_string("<-* Change mode  #->", LINE_4);
					previous_operation_state = operation_state;
					invgeo_error = 0;
					// Enable bluetooth module
					enable_BT_module();
					
