slaw0/async-robot/AT90CAN_ASYNC.c
				} 
				if (previous_controller_state != controller_state) {
					switch (controller_state) {
						case input:
						break;
						case hold:
							reset_line_2();
							reset_line_3();
							if (invgeo_error) add_string("   Invgeo error!    ", LINE_3);
						break;
						case accepted:
							invgeo_error = 0;
							reset_line_2();
							reset_line_3();
							add_string("Invgeo OK!", LINE_2);
						break;
						case trajectory:
							reset_line_2();
							reset_line_3();
							add_string("Following trajectory", LINE_2);
						break;
						default: break;
					}
					previous_controller_state = controller_state;
				}
				if (keys != previous_keys) {
					switch (keys) {
						case PREV_MODE_BUTTON:
							async_request_packet.data[0] = CONTROLLER_MODE_REQUEST;
							while(!can_tx(6, &async_request_packet));
							break;
						case NEXT_MODE_BUTTON:
							async_request_packet.data[0] = CONFIG_MODE_REQUEST;
							while(!can_tx(6, &async_request_packet));
							break;
						default: break;
					}
					previous_keys = keys;
				}
				break;
			/////////////////// CONFIG MODE ///////////////////////
			case config:
				if (previous_operation_state != operation_state) {
					reset_string();
					add_string("-   Config mode    -", LINE_1);

					switch(config_state) {
						case reset_incntrs:
							reset_line_2();
							add_string("<-1 Reset cntrs  3->", LINE_2);
							break;
						default: break;
					}

					add_string("S1:      S2:", LINE_3);
					add_string("<-* Change mode  #->", LINE_4);
					previous_operation_state = operation_state;

					disable_BT_module();
				}
				
				if (keys != previous_keys) {
					switch (keys) {
						case PREV_CONFIG_STATE_BUTTON:
							break;
						case NEXT_CONFIG_STATE_BUTTON:
							break;
						case RESET_INCNTR_REQUEST_BUTTON:
							request_incremental_counter_reset();
							async_request_packet.data[0] = EMPTY_REQUEST;
							while(!can_tx(6, &async_request_packet));
							break;
						case PREV_MODE_BUTTON:
							async_request_packet.data[0] = BLUETOOTH_MODE_REQUEST;
							while(!can_tx(6, &async_request_packet));
							break;
						case NEXT_MODE_BUTTON:
							async_request_packet.data[0] = PRIMITIVE_MODE_REQUEST;
							while(!can_tx(6, &async_request_packet));
							break;
						default: break;
					}
					previous_keys = keys;
				}
				break;
			default:
				break;
			}
			LCD_text();
		} else if (init_status == init_1) {
			reset_string();
			add_string("MPC init OK!", LINE_1);
			LCD_text();
		}
	}

	return 0;
}



/********************
void system init
initialises the controller for communication with the LCD and keyboard
***********************/

void system_init(){
	
	DDRE = 0xEE; //port E 7-5 are outputs for LCD, other pins are set for Bluetooth module
	DDRA = 0xFF; //all pins of port A are outputs
	DDRF = 0x0E; //keyboard columns are outputs
	PORTF = 0x0F; //keyboard columns are set high
	PORTC = 0xE0; //turn on pullup resistors on keyboard columns
	DDRC = 0x0F; //LEDs and the Bluetooth reset pin are outputs
	DDRD |= 0xA0; //SN65HVD enable signal is and CANTX are outputs
	PORTD &= 0x7F; //SN65HVD enable signal is low

	keys = 0x0000;
		
	TCCR1B |= (1 << WGM12);	//Timer 1 CTC mode, TOP is in OCR1A
	OCR1A = 1250;	//overflow occurs with 100Hz
	TIMSK1 = 1 << OCIE1A; //enable Timer channel A output compare interrupt
	/*
	init_CAN();
	*/
	LCD_init();
	can_init();
	UART_init();
	

	TCCR1B |= (1 << CS11)|(1 << CS10); //start timer
	

	
}


/** Initializes the UART module for communication with the BTM443 Bluetooth module */

void UART_init(){
	disable_BT_module();
	UCSR0A = 0x00;
	UBRR0H = 0x00;
	UBRR0L = 0x03; 	// Baud rate is set to 115k (assuming fclkio = 8MHz)
	UCSR0C = (1 << UCSZ01) | (1 <<UCSZ00); // 8-N-1 UART frame
	UCSR0B = (1 << RXCIE0) | (1 << RXEN0) | (1 << TXEN0); // Enables the receiver interrupt
}


/** Transmits the data, no handshaking included
 \param U8 data The data to be transmitted
 */
void UART_BT_transmit(U8 data){
	while ( ! ( UCSR0A & (1<<UDRE0)));
	UDR0 = data;
}

/************************
UART pin handling functions
*************************/

void UART_RTS_low(){
	PORTE &= ~0x04;
}

void UART_RTS_high(){
	PORTE |= 0x04;
}

U8 poll_UART_CTS(){
	if (PORTE & 0x10) return 1;
	return 0;
}


/** Enables the bluetooth module by driving RESET high */

void enable_BT_module() {
	PORTC |= 0x01;			// Set the RESET input of the Bluetooth module high
}

/** Disables the bluetooth module by driving RESET low */
void disable_BT_module() {
	PORTC &= ~(0x01);		// Set the RESET input of the Bluetooth module low
}

/********************
LCD pin handling functions
***********************/

void LCD_RS_high(){
	PORTE |= 0x20;
}

void LCD_RS_low(){
	PORTE &= 0xDF;
}

void LCD_RW_high(){
	PORTE |= 0x40;
}

void LCD_RW_low(){
	PORTE &= 0xBF;
}

void LCD_E_high(){
	PORTE |= 0x80;
}

void LCD_E_low(){
	PORTE &= 0x7F;
}

void LCD_DB(U8 data){
	PORTA = data;
}

/********************
LCD_comm
sends the command in COMM
***********************/

void LCD_comm(U8 RS, U8 RW, U8 comm){
	if (RS) LCD_RS_high();
	else LCD_RS_low();
	if (RW) LCD_RW_high();
	else LCD_RW_low();
	
	LCD_E_high();
	LCD_DB(comm);
	_delay_ms(0.1d);
	LCD_E_low();
	_delay_ms(0.1d);
}
	


/********************
LCD_clear()
clears the screen
***********************/

void LCD_clear(){
	LCD_comm(0,0,0x01);
	_delay_ms(2.0d);
}

/********************
LCD_return()
returns the cursor home
***********************/

void LCD_home(){
	LCD_comm(0,0,0x02);
	_delay_ms(2.0d);
}


/********************
LCD_init()
initalises the LCD for operation
***********************/

void LCD_init(){
	
	//waits 40ms (required by LCD after power on) //all wait values are doubled then increased tenfold for debugging!
	_delay_ms(200.0d);
	LCD_comm(0,0,0x30);
	_delay_ms(4.2d);
	LCD_comm(0,0,0x30);
	_delay_ms(1.0d);
	LCD_comm(0,0,0x30);
	//set 8 bit interface, 2 line, wide char
	_delay_ms(1.0d);
	LCD_comm(0,0,0x3C);
	_delay_ms(1.0d);
	//display off
	LCD_comm(0,0,0x08);
	_delay_ms(1.0d);
	LCD_clear();
	//sets entry mode
	LCD_comm(0,0,0x06);
	_delay_ms(1.0d);
	//displan on
	LCD_comm(0,0,0x0C);
	_delay_ms(1.0d);
}

