slaw0/async-robot/AT90CAN_ASYNC.c
/********************
LCD_text()
writes text to display, line == 1 ->first line, line == 2, second line
***********************/

void LCD_text(){
	U8 i;
	char bufr[40];
	
	for (i=0; i<20; i++) {
		bufr[i] = __string_buffer[i];
		bufr[i+20] = __string_buffer[i+40];
	}
	LCD_comm(0,0,0x80);
	_delay_ms(0.02d);
	for(i=0; i<40; i++){
		LCD_comm(1,0,bufr[i]);
	//	_delay_ms(0.02d);
	}
	for(i=0; i<20; i++){
		bufr[i] = __string_buffer[i+20];
		bufr[i+20] = __string_buffer[i+60];
	}
	LCD_comm(0,0,0xC0);
	for(i=0; i<40; i++){
		LCD_comm(1,0,bufr[i]);
	//	_delay_ms(0.02d);
	}

}

/********************
padstr()
Needs a null terminated input string (buffer) and a 80 character long char array(buf).
Pads the string it with whitespaces
to be 80 characters long, clips it if it's longer and 
puts it into the array.
***********************/

void padstr(char* buffer, char* buf){
	U8 i=0;
	while ((buffer[i] != '\0') && i<80){
		buf[i] = buffer[i];
		i++;
	}
	for(; i<80; i++) buf[i] = ' ';
}


/** Interrupt routine for USART0 RX complete */ 

ISR(USART0_RX_vect) {
	volatile U8 data = UDR0;
	static int16_t last_X = 0;
	static int16_t last_Y = 0;
	
	if (operation_state != bluetooth) return;
	
	switch(bt_package_flag){
		case 0://frame sync
			if ( data == (U8)"X" ) bt_package_flag++;
		break;
		case 1://X_H
			bt_coord_buffer = data << 8;
			bt_package_flag++;
		break;
		case 2://X_L
			bt_coord_buffer |= data;
			if(invgeo_error){
				input_coords[0] -= last_X;
			}
			last_X = bt_coord_buffer;
			input_coords[0] += bt_coord_buffer;
				
			bt_package_flag++;
		break;
		case 3://Y_H
			bt_coord_buffer = data << 8;
			bt_package_flag++;
		break;
		case 4://Y_L
			bt_coord_buffer |= data;
			if(invgeo_error){
				input_coords[1] -= last_Y;
			}
			last_X = bt_coord_buffer;
			input_coords[1] += bt_coord_buffer;
			
			bt_package_flag++; 
		break;
		case 5:
		default:
		break;
	}
	
	TWBR = data;	
	UART_BT_transmit(data);
	add_string(data, LINE_2);
}

/********************
Interrupt fuction which is called on Timer 1 A channel compare (every 100ms)
Currently handles the keyboard
***********************/

ISR(TIMER1_COMPA_vect){
	volatile U8 pressed = 0;
//	volatile char num[2];
	//num[1] = 0;
	NOP();

	cli();
	PINF = 0x02; //set first keyboard column low
	_delay_ms(0.01d);  //wait for propagation delay
	if (!(PINF & 0x01)) pressed = 10; //check if each row is pressed
	if (!(PINC & 0x80)) pressed = 7;
	if (!(PINC & 0x40)) pressed = 4;
	if (!(PINC & 0x20)) pressed = 1;
	PINF = 0x02; //set first keyboard column high

	PINF = 0x04; //set second keyboard column low
	_delay_ms(0.01d);	//wait for propagation delay
	if (!(PINF & 0x01)) pressed = 11; //check if each row is pressed
	if (!(PINC & 0x80)) pressed = 8;
	if (!(PINC & 0x40)) pressed = 5;
	if (!(PINC & 0x20)) pressed = 2;
	PINF = 0x04; //set second keyboard column high

	PINF = 0x08; //set third keyboard column high
	_delay_ms(0.01d);	//wait for propagation delay
	
	if (!(PINF & 0x01)) pressed = 12; //check if each row is pressed
	if (!(PINC & 0x80)) pressed = 9;
	if (!(PINC & 0x40)) pressed = 6;
	if (!(PINC & 0x20)) pressed = 3;
	PINF = 0x08; //set third keyboard column low
	sei();

	keys = pressed;
	
}

/********************
LED operation
***********************/

void green_LED_on(){
	PORTC |= 0x04;
}

void green_LED_off(){
	PORTC &= 0xFB;
}

void green_LED_toggle(){
	PINC |= 0x04;
}

void yellow_LED_on(){
	PORTC |= 0x08;
}

void yellow_LED_off(){
	PORTC &= 0xF7;
}

void yellow_LED_toggle(){
	PINC |= 0x08;
}


void red_LED_on(){
	PORTC |= 0x02;
}

void red_LED_off(){
	PORTC &= 0xFC;
}

void red_LED_toggle(){
	PINC |= 0x02;
}


/** Prepares the input_coords_packet with the given coordinates */

void prepare_input_coords_packet() {
	U8 i;
	for (i = 0; i < 2; i++) {
		input_coords_packet.data[i * 2] = (U8)(input_coords[i] >> 8);
		TWBR = input_coords_packet.data[i * 2];
		input_coords_packet.data[i * 2 + 1] = (U8)(input_coords[i]);
		TWBR = input_coords_packet.data[i * 2 + 1];
	}
	async_request_packet.data[0] = EMPTY_REQUEST;
	while(!can_tx(6, &async_request_packet));
}

/********************
Callback function for handling the incoming init CAN message
***********************/

void incoming_init(CAN_packet* p, unsigned char mob){
	cli();
	if ((p->data[0] == 0x01) /*&& (init_status == no_init)*/) {
		init_status = init_1;
		while(!can_tx(2, &init_ack_async_packet));
	} else if (p->data[0] == 0x02 && init_status == init_1) {
		init_status = init_2;
		reset_string();
		add_string("Init OK!", LINE_1);
		prepare_rx(4, 0x0A, 0xFF, incoming_incremental_out_value);
		prepare_rx(7, 0x0D, 0xFF, incoming_operation_mode_changed);
		prepare_rx(9, 0x10, 0xFF, incoming_controller_message);
		//prepare_rx(7, 0x07, 0xFF, incoming_incremental_in_value);
		init_status = running;
		operation_state = previous_operation_state = init;	
	}	
	sei();
}

/********************
Callback function for handling the incoming incremental_out_value CAN message
***********************/

void incoming_incremental_out_value(CAN_packet* p, unsigned char mob){
	cli();

	volatile U16 val1 = 0;
	volatile U16 val2 = 0;

	val1 = (U16)p->data[2];
	val1 = val1 << 8;
	val1 += (U16)p->data[3];

	val2 = (U16)p->data[0];
	val2 = val2 << 8;
	val2 += (U16)p->data[1];
	if ( (operation_state != bluetooth) && !( (operation_state == controller) && ((controller_state == input) || (invgeo_error == 1)) )) {
		add_U16_string(val1, LINE_3 + 3);
		add_U16_string(val2, LINE_3 + 12);
	}

	sei();
}

/********************
Callback function for handling the incoming incremental_in_value CAN message
***********************/

void incoming_incremental_in_value(CAN_packet* p, unsigned char mob){
	cli();

	volatile U16 val1 = 0;
	volatile U16 val2 = 0;

	val1 = (U16)p->data[0];
	val1 = val1 << 8;
	val1 += (U16)p->data[1];

	val2 = (U16)p->data[2];
	val2 = val2 << 8;
	val2 += (U16)p->data[3];

	add_U16_string(val1, LINE_3 + 3);
	add_U16_string(val2, LINE_3 + 12);

	sei();
}

/********************
Callback function for handling the incoming incoming_operation_mode CAN message
***********************/

void incoming_operation_mode_changed(CAN_packet* p, unsigned char mob){
	switch (p->data[0]) {
		case PRIMITIVE_MODE_ACK:
			operation_state = primitive;
			break;
		case CONTROLLER_MODE_ACK:
			operation_state = controller;
			break;
		case CONFIG_MODE_ACK:
			operation_state = config;
			break;
		case BLUETOOTH_MODE_ACK:
			operation_state = bluetooth;
			break;
		default: break;
	}
}

/** Callback function for handling the incoming controller_message CAN message */

void incoming_controller_message(CAN_packet* p, unsigned char mob) {
	if (operation_state != controller) return;
	switch (p->data[0]) {
		case CONTROLLER_HOLD_MESSAGE:
			controller_state = hold;
			break;
		case INVGEO_OK_MESSAGE:
			controller_state = accepted;
			break;
		case INVGEO_ERROR_MESSAGE:
			invgeo_error = 1;
			controller_state = hold;
			break;
		case ON_TRAJECTORY_MESSAGE:
			controller_state = trajectory;
			break;
		default: break;
	}
}

/********************
Sends async_request CAN messages asking to reset the incremental counter
***********************/
void request_incremental_counter_reset() {

	async_request_packet.data[0] = 0x07;
	while (!can_tx(6, &async_request_packet));
}

